test-scripts/load-tests/sensor-load-test.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      rampTo: 100
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 100
      name: "Sustained max load"
  variables:
    email: "admin@test.com"
    password: "admin123"
    sensorId: 1

scenarios:
  - name: "Sensor Data Processing"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            senha: "{{ password }}"
          capture:
            json: "$.data.token"
            as: "authToken"
      - post:
          url: "/api/leituras"
          headers:
            Cookie: "accessToken={{ authToken }}"
          json:
            sensorId: "{{ sensorId }}"
            valor: "{{ $randomNumber(60, 90) }}"
            timestamp: "{{ $timestamp }}"